# Brewfile — declarative Homebrew state.
#
#   brew bundle install            install everything listed below
#   brew bundle cleanup            DRY RUN: show what would be uninstalled
#   brew bundle cleanup --force    actually uninstall anything not listed here
#
# To remove a package from your machine: delete its line here, then run cleanup.
# This file was seeded from the current machine state, so cleanup is a no-op
# until you start removing lines.

# ---------------------------------------------------------------------------
# Taps
# ---------------------------------------------------------------------------
tap "andrewvos/tap"
tap "atlassian-labs/acli"
tap "avivsinai/tap"
tap "hashicorp/tap"
tap "oven-sh/bun"

# ---------------------------------------------------------------------------
# Formulae
# ---------------------------------------------------------------------------
brew "asdf"
brew "awscli"
brew "avivsinai/tap/bitbucket-cli"
brew "atlassian-labs/acli/acli"
brew "credstash"
brew "fswatch"
brew "gh"
brew "gnupg"
brew "helm@3", link: true
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "mas"
brew "oven-sh/bun/bun"
brew "pinentry-mac"
brew "ripgrep"
brew "ruby-build"
brew "sshuttle"
brew "hashicorp/tap/terraform"
brew "starship"
brew "stow"
brew "watch"
brew "wget"

# Ruby build dependencies
brew "openssl@3"
brew "readline"
brew "libyaml"
brew "gmp"

# ---------------------------------------------------------------------------
# Casks
# ---------------------------------------------------------------------------
cask "discord"
cask "docker-desktop"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "ghostty@tip"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "monitorcontrol"
cask "pinta"
cask "postgres-app"
cask "raycast"
cask "slack"
cask "tor-browser"
cask "visual-studio-code"

# ---------------------------------------------------------------------------
# Mac App Store (requires `mas`)
# ---------------------------------------------------------------------------
mas "Color Picker", id: 1545870783
mas "Enpass", id: 732710998
mas "Tailscale", id: 1475387142
mas "Unsplash Wallpapers", id: 1284863847
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
mas "SPIKE", id: 6443545905
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
