man-db
whois
jq
fzf
git
git-lfs
stow
exa
openssh
curl
wget
make
htop
shellcheck
ctags
redis
tig
tree
nnn
playerctl
laptop-detect
unzip
kakoune
ripgrep
fish
fd
git-delta
github-cli
xorg-server
xorg-xinit
xorg-xsetroot
alsa-utils
xwallpaper
ttf-ubuntu-font-family
ttf-dejavu
ttf-liberation
noto-fonts
wget
mpv
krita
xclip
flameshot
ttf-hack
bspwm
sxhkd
dmenu
rofi
dunst
redshift
unclutter
discord
picom
alacritty
hsetroot
imv
weechat
xdotool
qemu
libvirt
gnome-boxes
filelight
firefox
noto-fonts-emoji
peek
postgresql
postgresql-libs
hugo
tex-gyre-fonts
libertinus-font
peek
font-manager
xsel
sed
difftastic
encfs
pulseaudio-equalizer-ladspa
terminus-font
